# SQL Corner

* https://www.analyticsvidhya.com/blog/2022/06/an-introduction-to-joins-in-mysql/
* https://towardsdatascience.com/how-to-run-sql-queries-from-a-jupyter-notebook-aaa18e59e7bc

In [1]:
# install ipython-sql and comment it out once installed
# !pip install ipython-sql

In [2]:
# load sql and use sqlite as out database
%load_ext sql
%sql sqlite://

In [3]:
%%sql 
CREATE TABLE aTable
(
    pkey     INTEGER PRIMARY KEY,
    name     varchar(24)
);
INSERT INTO aTable (name)
VALUES ('Bugs Bunny'),
       ('Popeye'),
       ('Daffy Duck'),
       ('Mickey Mouse'),
       ('Minnie Mouse'),
       ('Tweety');
    
CREATE TABLE bTable
(
    pkey     INTEGER PRIMARY KEY,
    fkey     int,
    name     varchar(24)
);
INSERT INTO bTable(fkey, name)
VALUES (1, 'Bugs Bunny'),
       (2, 'Charlie Brown'),
       (3, 'Daffy Duck'),
       (4, 'Homer Simpson'),
       (5, 'Marge Simpson'),
       (6, 'Tweety');

 * sqlite://
Done.
6 rows affected.
Done.
6 rows affected.

[]

In [4]:
%%sql 
SELECT * FROM sqlite_master;

 * sqlite://
Done.

[('table', 'aTable', 'aTable', 2, 'CREATE TABLE aTable (\n    pkey     INTEGER PRIMARY KEY,\n    name     varchar(24)\n)'),
 ('table', 'bTable', 'bTable', 3, 'CREATE TABLE bTable\n(\n    pkey     INTEGER PRIMARY KEY,\n    fkey     int,\n    name     varchar(24)\n)')]

## JOINS

* https://www.w3schools.com/sql/sql_join.asp
* RIGHT and FULL OUTER JOINs are not currently supported in sqlite 3

In [5]:
%%sql
SELECT * FROM aTable JOIN bTable USING (pkey);

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 'Bugs Bunny'),
 (2, 'Popeye', 2, 'Charlie Brown'),
 (3, 'Daffy Duck', 3, 'Daffy Duck'),
 (4, 'Mickey Mouse', 4, 'Homer Simpson'),
 (5, 'Minnie Mouse', 5, 'Marge Simpson'),
 (6, 'Tweety', 6, 'Tweety')]

In [6]:
# save output from previous cell and create a dataframe
result = _
df = result.DataFrame()
df.columns = ['pkey', 'fkey', 'aTable', 'bTable']
df

   pkey          fkey  aTable         bTable
0     1    Bugs Bunny       1     Bugs Bunny
1     2        Popeye       2  Charlie Brown
2     3    Daffy Duck       3     Daffy Duck
3     4  Mickey Mouse       4  Homer Simpson
4     5  Minnie Mouse       5  Marge Simpson
5     6        Tweety       6         Tweety

#### LEFT JOIN

Return all records from aTable and values that match from bTable. If no match, return null (None)

In [7]:
%%sql
SELECT * FROM aTable
LEFT JOIN bTable
ON aTable.name = bTable.name;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 1, 'Bugs Bunny'),
 (2, 'Popeye', None, None, None),
 (3, 'Daffy Duck', 3, 3, 'Daffy Duck'),
 (4, 'Mickey Mouse', None, None, None),
 (5, 'Minnie Mouse', None, None, None),
 (6, 'Tweety', 6, 6, 'Tweety')]

#### LEFT JOIN WHERE

Return records from aTable and bTable based on some where condition

In [8]:
%%sql
SELECT * FROM aTable
LEFT JOIN bTable
ON aTable.name = bTable.name
WHERE bTable.fkey IS not null;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 1, 'Bugs Bunny'),
 (3, 'Daffy Duck', 3, 3, 'Daffy Duck'),
 (6, 'Tweety', 6, 6, 'Tweety')]

#### INNER JOIN

Returns the set of records that match in both aTable and bTable

In [9]:
%%sql
SELECT * FROM aTable
INNER JOIN bTable
ON aTable.name = bTable.name;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 1, 'Bugs Bunny'),
 (3, 'Daffy Duck', 3, 3, 'Daffy Duck'),
 (6, 'Tweety', 6, 6, 'Tweety')]

#### Using Aliases

In [10]:
%%sql
SELECT a.fkey, a.name FROM aTable a, btable b WHERE a.name = b.name;

 * sqlite://
(sqlite3.OperationalError) no such column: a.fkey
[SQL: SELECT a.fkey, a.name FROM aTable a, btable b WHERE a.name = b.name;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)